const enum 职业 {
    先锋 = 1,
    卫士 = 2,
    射手 = 3,
    术士 = 4,
    矿工 = 5,
    基地 = 6,
    矿 = 7,
}

const enum 阵营 {
    路障 = -1,
    我方 = 0,
    敌方 = 1,
}

const enum 属性 {
    生命 = 1,
    攻击 = 2,
    防御 = 3,
    挖掘速度百分比 = 4,
    矿工携带量 = 5,
    攻速 = 6,
    召唤速度 = 7,
    基地产出 = 8,
}

const enum 技能 {
    矿工_搞 = 1,
    矿工_包 = 2,
    剑士_剑 = 3,
    剑士_头盔 = 4,
    弓手_弓 = 5,
    矛兵_头盔 = 6,
    矛兵_盾 = 7,
    矛兵_矛 = 8,
    法师_杖 = 9,
    法师_召唤 = 10,
    巨人_武器 = 11,
    巨人_体型 = 12,
    基地_射手 = 13,
    基地_生命 = 14,
    基地_产出 = 15,
}

const enum 胜利条件 {
    摧毁基地 = 0,
    坚守到底 = 1,
}

const enum 物品 {
    黄金卷轴 = 1,
    修复卷轴 = 2,
    攻击卷轴 = 3,
    防御卷轴 = 4,
    虚弱卷轴 = 5,
    雷电卷轴 = 6,
    无敌卷轴 = 7,
    减速卷轴 = 8,
    加速卷轴 = 9,
    召唤卷轴 = 10,
}

const enum 单位 {
    矿工 = 1,
    民兵 = 2,
    射手 = 3,
    近卫 = 4,
    小恶魔 = 5,
    小飞侠 = 6,
    孙策 = 7,
    玩家基地 = 8,
    矿 = 9,
    第一关基地 = 10,
    迪亚波罗 = 11,
    麦格文 = 12,
    莱戈拉斯 = 13,
    米尔斯 = 14,
    剑盾卫士 = 15,
    剑士 = 16,
    掠夺者 = 17,
    魔剑勇者 = 18,
    见习法师 = 19,
    巫师 = 20,
    牧师 = 21,
    炼金术士 = 22,
    空斗士 = 23,
    审判天使 = 24,
    弩手 = 25,
    丛林游侠 = 26,
    步兵 = 27,
    战法师 = 28,
    巨斧手 = 29,
    武装铁匠 = 30,
    猎头者 = 31,
    烈焰术士 = 32,
    火枪手 = 33,
    白袍法师 = 34,
    独眼巨人 = 35,
    精钢勇者 = 36,
    暗影剑士 = 37,
    神圣祭司 = 38,
    熔岩巨人 = 39,
    花仙子 = 40,
    圣王雕像 = 41,
    大贤者 = 42,
    小天使 = 43,
    圣教军 = 44,
    巨人克星 = 45,
    远东武士 = 46,
    罗姆 = 47,
    艾丝 = 48,
}

const enum 锦标赛模式 {
    经典 = 0,
    决斗 = 1,
    淘金热 = 2,
    超级决斗 = 3,
    路障 = 4,
}

const enum 进攻策略 {
    永不进攻 = 0,
    满战斗人口进攻 = 1,
    超过敌人战斗人口进攻 = 2,
    无脑进攻 = 3,
}

const enum 撤退策略 {
    永不撤退 = 0,
    五成撤退 = 1,
    八成撤退 = 2,
}

const enum 攻击类型 {
    重击 = 1,
    穿刺 = 2,
    魔法 = 3,
    攻城 = 4,
    毁灭 = 5,
    无 = 6,
}

const enum 护甲类型 {
    重甲 = 1,
    轻甲 = 2,
    魔法 = 3,
    建筑 = 4,
    无 = 5,
}

const enum 稀有度 {
    普通 = 1,
    精锐 = 2,
    传说 = 3,
}

const enum 领地类型 {
    贸易 = 1,
    港口 = 2,
    都市 = 3,
    军工 = 4,
}

const enum 物品类型 {
    资源 = 1,
    道具 = 2,
    单位碎片 = 3,
    钻石 = 4,
    心灵徽记 = 5,
    战争碎片 = 6,
    智慧火花 = 101,
    后勤 = 102,
    古老雕像 = 103,
}

